levizh/hc32m423/ddl/hc32m423_ddl/driver/src/hc32m423_timera.c
#define IS_TIMERA_IC_CAPTURE_CONDITION(x)                                      \
(   (!((x) & ((uint16_t)(~TIMERA_CCONR_HICP_MASK))))        ||                 \
    ((x) == TIMERA_IC_INVALID))

#define IS_TIMERA_GET_FLAG(x)                                                  \
(   (TIMERA_FLAG_OVF == (x))                    ||                             \
    (TIMERA_FLAG_UDF == (x))                    ||                             \
    (TIMERA_FLAG_CMP1 == (x))                   ||                             \
    (TIMERA_FLAG_CMP2 == (x)))

#define IS_TIMERA_CLEAR_FLAG(x)                                                \
(   (!((x) & ((uint16_t)(~TIMERA_FALG_MASK))))              &&                 \
    (0U != (x)))

#define IS_TIMERA_INT(x)                                                       \
(   (!((x) & ((uint16_t)(~TIMERA_INT_MASK))))               &&                 \
    (0U != (x)))

#define IS_TIMERA_EVENT(x)                                                     \
(   (!((x) & ((uint16_t)(~TIMERA_EVENT_MASK))))             &&                 \
    (0U != (x)))

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup TIMERA_Global_Functions TimerA Global Functions
 * @{
 */

/**
 * @brief  De-Initialize TimerA unit base function.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @retval An en_result_t enumeration value:
 *           - Ok: De-Initialize success
 *           - ErrorInvalidParameter: TMRAx is invalid instance
 */
en_result_t TIMERA_DeInit(M0P_TMRA_TypeDef *TMRAx)
{
    uint8_t u8Cnt;
    __IO uint16_t *TMRA_CMPAR;
    __IO uint16_t *TMRA_BCONR;
    __IO uint16_t *TMRA_CCONR;
    __IO uint16_t *TMRA_PCONR;
    en_result_t enRet = Ok;

    /* Check TMRAx instance */
    if (!IS_TIMERA_INSTANCE(TMRAx))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Configures the registers to reset value. */
        WRITE_REG16(TMRAx->BCSTR, 0x0002U);
        WRITE_REG16(TMRAx->ICONR, 0x0000U);
        WRITE_REG16(TMRAx->ECONR, 0x0000U);
        WRITE_REG16(TMRAx->CNTER, 0x0000U);
        WRITE_REG16(TMRAx->PERAR, 0xFFFFu);
        WRITE_REG16(TMRAx->FCONR, 0x0000U);
        WRITE_REG16(TMRAx->STFLR, 0x0000U);
        WRITE_REG16(TMRAx->HCONR, 0x0000U);
        WRITE_REG16(TMRAx->HCUPR, 0x0000U);
        WRITE_REG16(TMRAx->HCDOR, 0x0000U);

        for (u8Cnt = 0U; u8Cnt < TIMERA_PWM_CHANNEL_NUMBER; u8Cnt++)
        {
            TMRA_CMPAR = (__IO uint16_t *)TMRA_CMPARx(TMRAx, u8Cnt);
            WRITE_REG16(*TMRA_CMPAR, 0xFFFFu);
            TMRA_CCONR = (__IO uint16_t *)TMRA_CCONRx(TMRAx, u8Cnt);
            WRITE_REG16(*TMRA_CCONR, 0x0000U);
            TMRA_PCONR = (__IO uint16_t *)TMRA_PCONRx(TMRAx, u8Cnt);
            WRITE_REG16(*TMRA_PCONR, 0x0000U);

            if ((u8Cnt % 2U) == 0U)
            {
                TMRA_BCONR = (__IO uint16_t *)TMRA_BCONRx(TMRAx, u8Cnt);
                WRITE_REG16(*TMRA_BCONR, 0x0000U);
            }
        }
        WRITE_REG16(M0P_AOS->TMRA_HTSSR, TIMERA_TRIG_SRC_MASK);
    }

    return enRet;
}

/**
 * @brief  Initialize TimerA base function.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] pstcInit                Pointer to a @ref stc_timera_init_t structure.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: TMRAx is invalid instance or pstcInit == NULL
 */
en_result_t TIMERA_Init(M0P_TMRA_TypeDef *TMRAx,
                        const stc_timera_init_t *pstcInit)
{
    en_result_t enRet = Ok;

    /* Check TMRAx instance and pstcInit */
    if ((!IS_TIMERA_INSTANCE(TMRAx)) || (NULL == pstcInit))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(0U != pstcInit->u16PeriodVal);
        DDL_ASSERT(IS_TIMERA_COUNT_MODE(pstcInit->u16CountMode));
        DDL_ASSERT(IS_TIMERA_COUNT_DIRECTION(pstcInit->u16CountDir));
        DDL_ASSERT(IS_TIMERA_CLK_DIV(pstcInit->u16ClkDiv));
        DDL_ASSERT(IS_TIMERA_OVERFLOW_STATE(pstcInit->u16OverflowAction));
        DDL_ASSERT(IS_TIMERA_HWSTART_CONDITION(pstcInit->u16HwStartCondition));
        DDL_ASSERT(IS_TIMERA_HWSTOP_CONDITION(pstcInit->u16HwStopCondition));
        DDL_ASSERT(IS_TIMERA_HWCLEAR_CONDITION(pstcInit->u16HwClearCondition));
        DDL_ASSERT(IS_TIMERA_HWUP_CONDITION(pstcInit->u16HwUpCondition));
        DDL_ASSERT(IS_TIMERA_HWDOWN_CONDITION(pstcInit->u16HwDownCondition));
        DDL_ASSERT(IS_TIMERA_TRIG_PORT_FILTER_STATE(pstcInit->u16TrigFilterState));
        DDL_ASSERT(IS_TIMERA_TRIG_PORT_FILTER_CLKDIV(pstcInit->u16TrigFilterClkDiv));
        DDL_ASSERT(IS_TIMERA_CLKA_PORT_FILTER_STATE(pstcInit->u16ClkAFilterState));
        DDL_ASSERT(IS_TIMERA_CLKA_PORT_FILTER_CLKDIV(pstcInit->u16ClkAFilterClkDiv));
        DDL_ASSERT(IS_TIMERA_CLKB_PORT_FILTER_STATE(pstcInit->u16ClkBFilterState));
        DDL_ASSERT(IS_TIMERA_CLKB_PORT_FILTER_CLKDIV(pstcInit->u16ClkBFilterClkDiv));

        WRITE_REG16(TMRAx->CNTER, 0U);
        WRITE_REG16(TMRAx->PERAR, pstcInit->u16PeriodVal);
        MODIFY_REG16(TMRAx->BCSTR,
                     (TMRA_BCSTR_DIR | TMRA_BCSTR_MODE | TMRA_BCSTR_OVSTP | TMRA_BCSTR_CKDIV),
                     (pstcInit->u16CountMode | pstcInit->u16CountDir |
                      pstcInit->u16OverflowAction | pstcInit->u16ClkDiv));

