levizh/hc32m423/ddl/hc32m423_ddl/driver/src/hc32m423_timera.c
    if (Enable == enNewSta)
    {
        SET_REG16_BIT(TMRAx->ECONR, u16EvtSource);
    }
    else
    {
        CLEAR_REG16_BIT(TMRAx->ECONR, u16EvtSource);
    }
}

/**
 * @brief  Enable or disable TimerA.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] enNewSta                The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void TIMERA_Cmd(M0P_TMRA_TypeDef *TMRAx, en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    if (Enable == enNewSta)
    {
        SET_REG16_BIT(TMRAx->BCSTR, TMRA_BCSTR_START);
    }
    else
    {
        CLEAR_REG16_BIT(TMRAx->BCSTR, TMRA_BCSTR_START);
    }
}

/**
 * @brief  Set TimerA TRIG Port noise filter clock division.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u16Div                  TimerA TRIG Port noise filter clock division
 *         This parameter can be one of the following values:
 *           @arg TIMERA_TRIG_CLKDIV_DIV1:   HCLK
 *           @arg TIMERA_TRIG_CLKDIV_DIV4:   HCLK/4
 *           @arg TIMERA_TRIG_CLKDIV_DIV16:  HCLK/16
 *           @arg TIMERA_TRIG_CLKDIV_DIV64:  HCLK/64
 * @retval None
 */
void TIMERA_SetTrigFilterClkDiv(M0P_TMRA_TypeDef *TMRAx, uint16_t u16Div)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_TRIG_PORT_FILTER_CLKDIV(u16Div));

    MODIFY_REG16(TMRAx->FCONR, TMRA_FCONR_NOFICKTG, u16Div);
}

/**
 * @brief  Enable or disable TimerA TRIG Port noise filter function.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] enNewSta                The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void TIMERA_TrigFilterCmd(M0P_TMRA_TypeDef *TMRAx, en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    if (Enable == enNewSta)
    {
        SET_REG16_BIT(TMRAx->FCONR, TMRA_FCONR_NOFIENTG);
    }
    else
    {
        CLEAR_REG16_BIT(TMRAx->FCONR, TMRA_FCONR_NOFIENTG);
    }
}

/**
 * @brief  Set TimerA CLKA Port noise filter clock division.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u16Div                  TimerA CLKA Port noise filter clock division
 *         This parameter can be one of the following values:
 *           @arg TIMERA_CLKA_CLKDIV_DIV1:   HCLK
 *           @arg TIMERA_CLKA_CLKDIV_DIV4:   HCLK/4
 *           @arg TIMERA_CLKA_CLKDIV_DIV16:  HCLK/16
 *           @arg TIMERA_CLKA_CLKDIV_DIV64:  HCLK/64
 * @retval None
 */
void TIMERA_SetClkAFilterClkDiv(M0P_TMRA_TypeDef *TMRAx, uint16_t u16Div)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_CLKA_PORT_FILTER_CLKDIV(u16Div));

    MODIFY_REG16(TMRAx->FCONR, TMRA_FCONR_NOFICKCA, u16Div);
}

/**
 * @brief  Enable or disable TimerA CLKA Port noise filter function.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] enNewSta                The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void TIMERA_ClkAFilterCmd(M0P_TMRA_TypeDef *TMRAx, en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    if (Enable == enNewSta)
    {
        SET_REG16_BIT(TMRAx->FCONR, TMRA_FCONR_NOFIENCA);
    }
    else
    {
        CLEAR_REG16_BIT(TMRAx->FCONR, TMRA_FCONR_NOFIENCA);
    }
}

/**
 * @brief  Set TimerA CLKB Port noise filter clock division.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u16Div                  TimerA CLKB Port noise filter clock division
 *         This parameter can be one of the following values:
 *           @arg TIMERA_CLKB_CLKDIV_DIV1:   HCLK
 *           @arg TIMERA_CLKB_CLKDIV_DIV4:   HCLK/4
 *           @arg TIMERA_CLKB_CLKDIV_DIV16:  HCLK/16
 *           @arg TIMERA_CLKB_CLKDIV_DIV64:  HCLK/64
 * @retval None
 */
void TIMERA_SetClkBFilterClkDiv(M0P_TMRA_TypeDef *TMRAx, uint16_t u16Div)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_CLKB_PORT_FILTER_CLKDIV(u16Div));

    MODIFY_REG16(TMRAx->FCONR, TMRA_FCONR_NOFICKCB, u16Div);
}

/**
 * @brief  Enable or disable TimerA CLKB Port noise filter function.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] enNewSta                The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void TIMERA_ClkBFilterCmd(M0P_TMRA_TypeDef *TMRAx, en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));


