levizh/hc32m423/ddl/hc32m423_ddl/driver/src/hc32m423_timera.c
    WRITE_REG16(TMRAx->HCUPR, u16Condition);
}

/**
 * @brief  Get TimerA hardware up counter condition.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @retval Returned value can be one or any combination of the following values:
 *           @arg TIMERA_HWUP_INVALID:                  Hardware count up is invalid
 *           @arg TIMERA_HWUP_CLKA_LOW_CLKB_RISING:     Hardware count up by rising edge on timer input TIMA_<t>_CLKB when TIMA_<t>_CLKA is low level
 *           @arg TIMERA_HWUP_CLKA_LOW_CLKB_FALLING:    Hardware count up by falling edge on timer input TIMA_<t>_CLKB when TIMA_<t>_CLKA is low level
 *           @arg TIMERA_HWUP_CLKA_HIGH_CLKB_RISING:    Hardware count up by rising edge on timer input TIMA_<t>_CLKB when TIMA_<t>_CLKA is high level
 *           @arg TIMERA_HWUP_CLKA_HIGH_CLKB_FALLING:   Hardware count up by falling edge on timer input TIMA_<t>_CLKB when TIMA_<t>_CLKA is high level
 *           @arg TIMERA_HWUP_CLKB_LOW_CLKA_RISING:     Hardware count up by rising edge on timer input TIMA_<t>_CLKA when TIMA_<t>_CLKB is low level
 *           @arg TIMERA_HWUP_CLKB_LOW_CLKA_FALLING:    Hardware count up by falling edge on timer input TIMA_<t>_CLKA when TIMA_<t>_CLKB is low level
 *           @arg TIMERA_HWUP_CLKB_HIGH_CLKA_RISING:    Hardware count up by rising edge on timer input TIMA_<t>_CLKA when TIMA_<t>_CLKB is high level
 *           @arg TIMERA_HWUP_CLKB_HIGH_CLKA_FALLING:   Hardware count up by falling edge on timer input TIMA_<t>_CLKA when TIMA_<t>_CLKB is high level
 *           @arg TIMERA_HWUP_TRIG_RISING:              Hardware count up by rising edge on timer input TIMA_<t>_TRIG
 *           @arg TIMERA_HWUP_TRIG_FALLING:             Hardware count up by falling edge on timer input TIMA_<t>_TRIG
 *           @arg TIMERA_HWUP_SPECIFY_EVT:              Hardware count up by the timer TMRA_HTSSR specified event
 */
uint16_t TIMERA_GetHwUpCondition(M0P_TMRA_TypeDef *TMRAx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));

    return READ_REG16(TMRAx->HCUPR);
}

/**
 * @brief  Set TimerA hardware down counter condition.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u16Condition            TimerA hardware down counter condition
 *         This parameter can be one or any combination of the following values:
 *           @arg TIMERA_HWDOWN_INVALID:                  Hardware count down is invalid
 *           @arg TIMERA_HWDOWN_CLKA_LOW_CLKB_RISING:     Hardware count down by rising edge on timer input TIMA_<t>_CLKB when TIMA_<t>_CLKA is low level
 *           @arg TIMERA_HWDOWN_CLKA_LOW_CLKB_FALLING:    Hardware count down by falling edge on timer input TIMA_<t>_CLKB when TIMA_<t>_CLKA is low level
 *           @arg TIMERA_HWDOWN_CLKA_HIGH_CLKB_RISING:    Hardware count down by rising edge on timer input TIMA_<t>_CLKB when TIMA_<t>_CLKA is high level
 *           @arg TIMERA_HWDOWN_CLKA_HIGH_CLKB_FALLING:   Hardware count down by falling edge on timer input TIMA_<t>_CLKB when TIMA_<t>_CLKA is high level
 *           @arg TIMERA_HWDOWN_CLKB_LOW_CLKA_RISING:     Hardware count down by rising edge on timer input TIMA_<t>_CLKA when TIMA_<t>_CLKB is low level
 *           @arg TIMERA_HWDOWN_CLKB_LOW_CLKA_FALLING:    Hardware count down by falling edge on timer input TIMA_<t>_CLKA when TIMA_<t>_CLKB is low level
 *           @arg TIMERA_HWDOWN_CLKB_HIGH_CLKA_RISING:    Hardware count down by rising edge on timer input TIMA_<t>_CLKA when TIMA_<t>_CLKB is high level
 *           @arg TIMERA_HWDOWN_CLKB_HIGH_CLKA_FALLING:   Hardware count down by falling edge on timer input TIMA_<t>_CLKA when TIMA_<t>_CLKB is high level
 *           @arg TIMERA_HWDOWN_TRIG_RISING:              Hardware count down by rising edge on timer input TIMA_<t>_TRIG
 *           @arg TIMERA_HWDOWN_TRIG_FALLING:             Hardware count down by falling edge on timer input TIMA_<t>_TRIG
 *           @arg TIMERA_HWDOWN_SPECIFY_EVT:              Hardware count down by the timer TMRA_HTSSR specified event
 * @retval  None
 */
void TIMERA_SetHwDownCondition(M0P_TMRA_TypeDef *TMRAx, uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_HWDOWN_CONDITION(u16Condition));

    WRITE_REG16(TMRAx->HCDOR, u16Condition);
}

/**
 * @brief  Get TimerA hardware down counter condition.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @retval Returned value can be one or any combination of the following values:
 *           @arg TIMERA_HWDOWN_INVALID:                  Hardware count down is invalid
 *           @arg TIMERA_HWDOWN_CLKA_LOW_CLKB_RISING:     Hardware count down by rising edge on timer input TIMA_<t>_CLKB when TIMA_<t>_CLKA is low level
 *           @arg TIMERA_HWDOWN_CLKA_LOW_CLKB_FALLING:    Hardware count down by falling edge on timer input TIMA_<t>_CLKB when TIMA_<t>_CLKA is low level
 *           @arg TIMERA_HWDOWN_CLKA_HIGH_CLKB_RISING:    Hardware count down by rising edge on timer input TIMA_<t>_CLKB when TIMA_<t>_CLKA is high level
 *           @arg TIMERA_HWDOWN_CLKA_HIGH_CLKB_FALLING:   Hardware count down by falling edge on timer input TIMA_<t>_CLKB when TIMA_<t>_CLKA is high level
 *           @arg TIMERA_HWDOWN_CLKB_LOW_CLKA_RISING:     Hardware count down by rising edge on timer input TIMA_<t>_CLKA when TIMA_<t>_CLKB is low level
 *           @arg TIMERA_HWDOWN_CLKB_LOW_CLKA_FALLING:    Hardware count down by falling edge on timer input TIMA_<t>_CLKA when TIMA_<t>_CLKB is low level
 *           @arg TIMERA_HWDOWN_CLKB_HIGH_CLKA_RISING:    Hardware count down by rising edge on timer input TIMA_<t>_CLKA when TIMA_<t>_CLKB is high level
 *           @arg TIMERA_HWDOWN_CLKB_HIGH_CLKA_FALLING:   Hardware count down by falling edge on timer input TIMA_<t>_CLKA when TIMA_<t>_CLKB is high level
 *           @arg TIMERA_HWDOWN_TRIG_RISING:              Hardware count down by rising edge on timer input TIMA_<t>_TRIG
 *           @arg TIMERA_HWDOWN_TRIG_FALLING:             Hardware count down by falling edge on timer input TIMA_<t>_TRIG
 *           @arg TIMERA_HWDOWN_SPECIFY_EVT:              Hardware count down by the timer TMRA_HTSSR specified event
 */
uint16_t TIMERA_GetHwDownCondition(M0P_TMRA_TypeDef *TMRAx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));

