levizh/hc32m423/ddl/hc32m423_ddl/driver/src/hc32m423_timera.c
    return READ_REG16(TMRAx->HCDOR);
}

/**
 * @brief  De-Initialize TimerA unit input capture.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u8Channel               TimerA input capture channel
           This parameter can be one of the following values:
             @arg TIMERA_CHANNEL_CH1:   TimerA PWM Channel 1
             @arg TIMERA_CHANNEL_CH2:   TimerA PWM Channel 2
 * @retval An en_result_t enumeration value:
 *           - Ok: De-Initialize success
 *           - ErrorInvalidParameter: TMRAx is invalid instance
 */
en_result_t TIMERA_IC_DeInit(M0P_TMRA_TypeDef *TMRAx,
                             uint8_t u8Channel)
{
    __IO uint16_t *TMRA_CMPAR;
    __IO uint16_t *TMRA_BCONR;
    __IO uint16_t *TMRA_CCONR;
    en_result_t enRet = Ok;

    /* Check TMRAx instance */
    if (!IS_TIMERA_INSTANCE(TMRAx))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_TIMERA_CHANNEL(u8Channel));

        /* Configures the registers to reset value. */
        TMRA_CMPAR = (__IO uint16_t *)TMRA_CMPARx(TMRAx, u8Channel);
        WRITE_REG16(*TMRA_CMPAR, 0xFFFFu);
        TMRA_CCONR = (__IO uint16_t *)TMRA_CCONRx(TMRAx, u8Channel);
        WRITE_REG16(*TMRA_CCONR, TIMERA_INPUT_CAPTURE);

        if ((u8Channel % 2U) == 0U)
        {
            TMRA_BCONR = (__IO uint16_t *)TMRA_BCONRx(TMRAx, u8Channel);
            WRITE_REG16(*TMRA_BCONR, 0x0000U);
        }
    }

    return enRet;
}

/**
 * @brief  Initialize TimerA input capture function.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u8Channel               TimerA input capture channel
           This parameter can be one of the following values:
             @arg TIMERA_CHANNEL_CH1:   TimerA PWM Channel 1
             @arg TIMERA_CHANNEL_CH2:   TimerA PWM Channel 2
 * @param  [in] pstcIcInit              Pointer to a @ref stc_timera_ic_init_t structure.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: TMRAx is invalid instance or pstcIcInit == NULL
 */
en_result_t TIMERA_IC_Init(M0P_TMRA_TypeDef *TMRAx, uint8_t u8Channel,
                           const stc_timera_ic_init_t *pstcIcInit)
{
    __IO uint16_t *TMRA_CCONR;
    en_result_t enRet = Ok;

    /* Check TMRAx instance and pstcIcInit */
    if ((!IS_TIMERA_INSTANCE(TMRAx)) || (NULL == pstcIcInit))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_TIMERA_CHANNEL(u8Channel));
        DDL_ASSERT(IS_TIMERA_IC_CAPTURE_CONDITION(pstcIcInit->u16CaptureCondition));
        DDL_ASSERT(IS_TIMERA_IC_PWM_PORT_FILTER_STATE(pstcIcInit->u16PwmFilterState));
        DDL_ASSERT(IS_TIMERA_IC_PWM_PORT_FILTER_CLKDIV(pstcIcInit->u16PwmFilterClkDiv));

        TMRA_CCONR = (__IO uint16_t *)TMRA_CCONRx(TMRAx, u8Channel);
        MODIFY_REG16(*TMRA_CCONR,
                     (TMRA_CCONR1_NOFIENCP | TMRA_CCONR1_NOFICKCP |
                      TMRA_CCONR1_CAPMD | TIMERA_CCONR_HICP_MASK),
                     (TIMERA_INPUT_CAPTURE | pstcIcInit->u16CaptureCondition |
                      pstcIcInit->u16PwmFilterState | pstcIcInit->u16PwmFilterClkDiv));
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_timera_ic_init_t to default values.
 * @param  [out] pstcIcInit             Pointer to a @ref stc_timera_ic_init_t structure.
 * @retval None
 */
en_result_t TIMERA_IC_StructInit(stc_timera_ic_init_t *pstcIcInit)
{
    en_result_t enRet = Ok;

    /* Check parameters */
    if (NULL == pstcIcInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        pstcIcInit->u16PwmFilterState = TIMERA_IC_PWM_FILTER_DISABLE;
        pstcIcInit->u16PwmFilterClkDiv = TIMERA_IC_PWM_CLKDIV_DIV1;
        pstcIcInit->u16CaptureCondition = TIMERA_IC_INVALID;
    }

    return enRet;
}

/**
 * @brief  Get TimerA capture register value.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u8Channel               TimerA input capture channel
           This parameter can be one of the following values:
             @arg TIMERA_CHANNEL_CH1:   TimerA PWM Channel 1
             @arg TIMERA_CHANNEL_CH2:   TimerA PWM Channel 2
 * @retval Compare value (between 0 and 0xFFFF)
 */
uint16_t TIMERA_IC_GetCapture(M0P_TMRA_TypeDef *TMRAx,
                              uint8_t u8Channel)
{
    __IO uint16_t *TMRA_CMPAR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_CHANNEL(u8Channel));

    /* Configures the registers to reset value. */
    TMRA_CMPAR = (__IO uint16_t *)TMRA_CMPARx(TMRAx, u8Channel);
    return READ_REG16(*TMRA_CMPAR);
}

/**
 * @brief  Set TimerA input capture condition.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u8Channel               TimerA input capture channel
           This parameter can be one of the following values:
             @arg TIMERA_CHANNEL_CH1:   TimerA PWM Channel 1
             @arg TIMERA_CHANNEL_CH2:   TimerA PWM Channel 2
 * @param  [in] u16Condition            TimerA input capture condition
 *         This parameter can be one or any combination of the following values:
 *           @arg TIMERA_IC_PWM_RISING:    Capture triggered by rising edge on timer input TIMA_<t>_PWMn
 *           @arg TIMERA_IC_PWM_FALLING:    Capture triggered by falling edge on timer input TIMA_<t>_PWMn
 *           @arg TIMERA_IC_SPECIFY_EVT:    Capture triggered by the timer TMRA_HTSSR specified event
 *           @arg TIMERA_IC_INVALID:        Don't occur capture action
 * @retval None
 */
void TIMERA_IC_SetCaptureCondition(M0P_TMRA_TypeDef *TMRAx,
                                   uint8_t u8Channel,
                                   uint16_t u16Condition)
{
    __IO uint16_t *TMRA_CCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_CHANNEL(u8Channel));
    DDL_ASSERT(IS_TIMERA_IC_CAPTURE_CONDITION(u16Condition));

    TMRA_CCONR = (__IO uint16_t *)TMRA_CCONRx(TMRAx, u8Channel);
    MODIFY_REG16(*TMRA_CCONR, TIMERA_CCONR_HICP_MASK, u16Condition);
}

/**
 * @brief  Enable or Disable TimerA input capture noise filter function.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u8Channel               TimerA input capture channel
           This parameter can be one of the following values:
             @arg TIMERA_CHANNEL_CH1:   TimerA PWM Channel 1
             @arg TIMERA_CHANNEL_CH2:   TimerA PWM Channel 2
 * @param  [in] enNewSta                The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void TIMERA_IC_FilterCmd(M0P_TMRA_TypeDef *TMRAx, uint8_t u8Channel,
                         en_functional_state_t enNewSta)
{
    __IO uint16_t *TMRA_CCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_CHANNEL(u8Channel));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    TMRA_CCONR = (__IO uint16_t *)TMRA_CCONRx(TMRAx, u8Channel);
    if (Enable == enNewSta)
    {
        SET_REG16_BIT(*TMRA_CCONR, TMRA_CCONR1_NOFIENCP);
    }
    else
    {
        CLEAR_REG16_BIT(*TMRA_CCONR, TMRA_CCONR1_NOFIENCP);
    }
}

/**
 * @brief  Set TimerA PWM Port input capture noise filter clock division.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u8Channel               TimerA input capture channel
           This parameter can be one of the following values:
             @arg TIMERA_CHANNEL_CH1:   TimerA PWM Channel 1
             @arg TIMERA_CHANNEL_CH2:   TimerA PWM Channel 2
 * @param  [in] u16Div                  TimerA input capture noise filter clock division
 *         This parameter can be one of the following values:
 *           @arg TIMERA_IC_PWM_CLKDIV_DIV1:    HCLK
 *           @arg TIMERA_IC_PWM_CLKDIV_DIV4:    HCLK/4
 *           @arg TIMERA_IC_PWM_CLKDIV_DIV16:   HCLK/16
 *           @arg TIMERA_IC_PWM_CLKDIV_DIV64:   HCLK/64
 * @retval None
 */
void TIMERA_IC_SetFilterClkDiv(M0P_TMRA_TypeDef *TMRAx,
                               uint8_t u8Channel, uint16_t u16Div)
{
    __IO uint16_t *TMRA_CCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_CHANNEL(u8Channel));
    DDL_ASSERT(IS_TIMERA_IC_PWM_PORT_FILTER_CLKDIV(u16Div));

    TMRA_CCONR = (__IO uint16_t *)TMRA_CCONRx(TMRAx, u8Channel);
    MODIFY_REG16(*TMRA_CCONR, TMRA_CCONR1_NOFICKCP, u16Div);
}

/**
 * @brief  De-Initialize TimerA unit output compare.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u8Channel               TimerA output compare channel
           This parameter can be one of the following values:
             @arg TIMERA_CHANNEL_CH1:   TimerA PWM Channel 1
             @arg TIMERA_CHANNEL_CH2:   TimerA PWM Channel 2
 * @retval An en_result_t enumeration value:
 *           - Ok: De-Initialize success
 *           - ErrorInvalidParameter: TMRAx is invalid instance
 */
en_result_t TIMERA_OC_DeInit(M0P_TMRA_TypeDef *TMRAx,
                             uint8_t u8Channel)
{
    __IO uint16_t *TMRA_CMPAR;
    __IO uint16_t *TMRA_BCONR;
    __IO uint16_t *TMRA_CCONR;
    __IO uint16_t *TMRA_PCONR;
    en_result_t enRet = Ok;

    /* Check TMRAx instance */
    if (!IS_TIMERA_INSTANCE(TMRAx))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_TIMERA_CHANNEL(u8Channel));

