levizh/hc32m423/ddl/hc32m423_ddl/driver/src/hc32m423_timera.c
    TMRA_PCONR = (__IO uint16_t *)TMRA_PCONRx(TMRAx, u8Channel);
    MODIFY_REG16(*TMRA_PCONR, TMRA_PCONR1_PERC, u16Polarity);
}

/**
 * @brief  Set TIMA_<t>_PWMn port output polarity for force.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u8Channel               TimerA output compare channel
           This parameter can be one of the following values:
             @arg TIMERA_CHANNEL_CH1:   TimerA PWM Channel 1
             @arg TIMERA_CHANNEL_CH2:   TimerA PWM Channel 2
 * @param  [in] u16Polarity             TimerA TIMA_<t>_PWMn port output polarity
 *         This parameter can be one of the following values:
 *           @arg TIMERA_OC_FORCE_OUTPUT_LOW:       Force TIMA_<t>_PWMn output low level
 *           @arg TIMERA_OC_FORCE_OUTPUT_HIGH:      Force TIMA_<t>_PWMn output high level
 *           @arg TIMERA_OC_FORCE_OUTPUT_INVALID:   Force invalid
 * @retval None
 */
void TIMERA_OC_SetForceOutputPolarity(M0P_TMRA_TypeDef *TMRAx,
                                      uint8_t u8Channel,
                                      uint16_t u16Polarity)
{
    __IO uint16_t *TMRA_PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_CHANNEL(u8Channel));
    DDL_ASSERT(IS_TIMERA_OC_FORCE_OUTPUT_POLARITY(u16Polarity));

    TMRA_PCONR = (__IO uint16_t *)TMRA_PCONRx(TMRAx, u8Channel);
    MODIFY_REG16(*TMRA_PCONR, TMRA_PCONR1_FORC, u16Polarity);
}

/**
 * @brief  Enable or Disable TimerA PWM output cache function.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u8Channel               TimerA output compare channel
           This parameter can be one of the following values:
             @arg TIMERA_CHANNEL_CH1:   TimerA PWM Channel 1
 * @param  [in] enNewSta                The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval An en_result_t enumeration value:
 *           - Ok: Configure success
 *           - ErrorInvalidParameter: u8Channel is invalid
 */
en_result_t TIMERA_OC_CacheCmd(M0P_TMRA_TypeDef *TMRAx,
                               uint8_t u8Channel,
                               en_functional_state_t enNewSta)
{
    __IO uint16_t *TMRA_BCONRx;
    en_result_t enRet = Ok;

    /* Check channel validity */
    if ((u8Channel % 2U) != 0U)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));
        DDL_ASSERT(IS_TIMERA_CACHE_CHANNEL(u8Channel));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

        TMRA_BCONRx = (__IO uint16_t *)TMRA_BCONRx(TMRAx, u8Channel);
        if (Enable == enNewSta)
        {
            SET_REG16_BIT(*TMRA_BCONRx, TMRA_BCONR_BEN);
        }
        else
        {
            CLEAR_REG16_BIT(*TMRA_BCONRx, TMRA_BCONR_BEN);
        }
    }

    return enRet;
}

/**
 * @brief  Set TimerA PWM output cache transmit condition.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u8Channel               TimerA output compare channel
           This parameter can be one of the following values:
             @arg TIMERA_CHANNEL_CH1:   TimerA PWM Channel 1
 * @param  [in] u16Condition            TimerA input capture condition
 *         This parameter can be one or any combination of the following values:
 *           @arg TIMERA_OC_CACHE_TRANSMIT_CREST:   In Triangular wave crest transmit cache value
 *           @arg TIMERA_OC_CACHE_TRANSMIT_TROUGH:  In Triangular wave trough transmit cache value
 *           @arg TIMERA_OC_CACHE_TRANSMIT_INVALID: Invalid cache transmit
 * @retval An en_result_t enumeration value:
 *           - Ok: Configure success
 *           - ErrorInvalidParameter: u8Channel is invalid
 */
en_result_t TIMERA_OC_SetCacheTransmitCondition(M0P_TMRA_TypeDef *TMRAx,
                                                uint8_t u8Channel,
                                                uint16_t u16Condition)
{
    __IO uint16_t *TMRA_BCONRx;
    en_result_t enRet = Ok;

    /* Check channel validity */
    if ((u8Channel % 2U) != 0U)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));
        DDL_ASSERT(IS_TIMERA_CACHE_CHANNEL(u8Channel));
        DDL_ASSERT(IS_TIMERA_OC_CACHE_TRANS_CONDITION(u16Condition));

        TMRA_BCONRx = (__IO uint16_t *)TMRA_BCONRx(TMRAx, u8Channel);
        MODIFY_REG16(*TMRA_BCONRx, TIMERA_BCONR_BSE_MASK, u16Condition);
    }

    return enRet;
}

/**
 * @brief  Get TimerA flag status.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u16Flag                 TimerA flag type
 *         This parameter can be one of the following values:
 *           @arg TIMERA_FLAG_OVF:      Overflow flag
 *           @arg TIMERA_FLAG_UDF:      Underflow flag
 *           @arg TIMERA_FLAG_CMP1:     PWM Channel 1 compare match flag
 *           @arg TIMERA_FLAG_CMP2:     PWM Channel 2 compare match flag
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t TIMERA_GetFlag(M0P_TMRA_TypeDef *TMRAx, uint16_t u16Flag)
{
    en_flag_status_t enFlag = Reset;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_GET_FLAG(u16Flag));

    switch (u16Flag)
    {
        case TIMERA_FLAG_OVF:
        case TIMERA_FLAG_UDF:
            enFlag = (READ_BIT(TMRAx->BCSTR, u16Flag)) ? Set : Reset;
            break;
        case TIMERA_FLAG_CMP1:
        case TIMERA_FLAG_CMP2:
            enFlag = (READ_BIT(TMRAx->STFLR, u16Flag)) ? Set : Reset;
            break;
        default:
            break;
    }

