levizh/hc32m423/ddl/hc32m423_ddl/driver/src/hc32m423_timera.c
    return enFlag;
}

/**
 * @brief  Clear TimerA flag.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u16Flag                 TimerA flag type
 *         This parameter can be one or any combination of the following values:
 *           @arg TIMERA_FLAG_OVF:      Overflow flag
 *           @arg TIMERA_FLAG_UDF:      Underflow flag
 *           @arg TIMERA_FLAG_CMP1:     PWM Channel 1 compare match flag
 *           @arg TIMERA_FLAG_CMP2:     PWM Channel 2 compare match flag
 * @retval None
 */
void TIMERA_ClearFlag(M0P_TMRA_TypeDef *TMRAx, uint16_t u16Flag)
{
    uint16_t u16Tmp;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_CLEAR_FLAG(u16Flag));

    /* OVF and UDF flag */
    u16Tmp = u16Flag & 0xFF00U;
    if (0U != u16Tmp)
    {
        CLEAR_REG16_BIT(TMRAx->BCSTR, u16Tmp);
    }

    /* Count match flag */
    u16Tmp = u16Flag & 0x00FFu;
    if (0U != u16Tmp)
    {
        CLEAR_REG16_BIT(TMRAx->STFLR, u16Tmp);
    }
}

/**
 * @brief  Enable or disable specified TimerA interrupt.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u16IntSource            TimerA interrupt source
 *         This parameter can be one or any combination of the following values:
 *           @arg TIMERA_INT_OVF:       Overflow interrupt
 *           @arg TIMERA_INT_UDF:       Underflow interrupt
 *           @arg TIMERA_INT_CMP1:      PWM Channel 1 Compare match interrupt
 *           @arg TIMERA_INT_CMP2:      PWM Channel 2 Compare match interrupt
 * @param  [in] enNewSta                The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void TIMERA_IntCmd(M0P_TMRA_TypeDef *TMRAx,
                   uint16_t u16IntSource,
                   en_functional_state_t enNewSta)
{
    uint16_t u16Tmp;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_INT(u16IntSource));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    /* OVF and UDF interrupt */
    u16Tmp = u16IntSource & 0xFF00U;
    if (0U != u16Tmp)
    {
        if (Enable == enNewSta)
        {
            SET_REG16_BIT(TMRAx->BCSTR, u16Tmp);
        }
        else
        {
            CLEAR_REG16_BIT(TMRAx->BCSTR, u16Tmp);
        }
    }

    /* Count match interrupt */
    u16Tmp = u16IntSource & 0x00FFu;
    if (0U != u16Tmp)
    {
        if (Enable == enNewSta)
        {
            SET_REG16_BIT(TMRAx->ICONR, u16Tmp);
        }
        else
        {
            CLEAR_REG16_BIT(TMRAx->ICONR, u16Tmp);
        }
    }
}

/**
 * @}
 */

#endif /* DDL_TIMERA_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
